CSI API ETABS v1
cDatabaseTables.GetTableForDisplayCSVString Method
 Returns data for a single table in a CSV string. If there is nothing to be shown in the table then no data is returned.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTableForDisplayCSVString(
	string TableKey,
	ref string[] FieldKeyList,
	string GroupName,
	ref int TableVersion,
	ref string csvString,
	string sepChar = ","
)
Function GetTableForDisplayCSVString (
	TableKey As String,
	ByRef FieldKeyList As String(),
	GroupName As String,
	ByRef TableVersion As Integer,
	ByRef csvString As String,
	Optional sepChar As String = ","
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim FieldKeyList As String()
Dim GroupName As String
Dim TableVersion As Integer
Dim csvString As String
Dim sepChar As String
Dim returnValue As Integer
returnValue = instance.GetTableForDisplayCSVString(TableKey,
	FieldKeyList, GroupName, TableVersion,
	csvString, sepChar)
int GetTableForDisplayCSVString(
	String^ TableKey,
	array<String^>^% FieldKeyList,
	String^ GroupName,
	int% TableVersion,
	String^% csvString,
	String^ sepChar = L","
)
abstract GetTableForDisplayCSVString :
        TableKey : string *
        FieldKeyList : string[] byref *
        GroupName : string *
        TableVersion : int byref *
        csvString : string byref *
        ?sepChar : string
(* Defaults:
        let _sepChar = defaultArg sepChar ","
*)
-> int
Parameters
TableKey
Type: System.String
Input Item: The table key of the table for which data is requested.
FieldKeyList
Type: System.String[]
Input Item: A zero-based array listing the field keys associated with the specified table for which data is requested.
GroupName
Type: System.String
Input Item: The name of a group for which data will be returned.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
csvString
Type: System.String
Returned Item: A CSV-formatted string containing all the table data.
sepChar (Optional)
Type: System.String
Optional Input Item: The delimiter between data items, by default ","
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 If the FieldKeyList array contains a single blank string the data will be provided for all fields. If the GroupName is All, or a blank string, then data will be returned for all applicable objects in the model.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace